micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc.c
         (#) MSI is a low-power RC oscillator which can be used directly as system clock, peripheral
             clock, or PLL input.But even with frequency calibration, is less accurate than an
             external crystal oscillator or ceramic resonator.

         (#) LSI (low-speed internal), 32 KHz low consumption RC used as IWDG and/or RTC
             clock source.

         (#) HSE (high-speed external), 4 to 48 MHz crystal oscillator used directly or
             through the PLL as System clock source. Can be used also as RTC clock source.

         (#) LSE (low-speed external), 32 KHz oscillator used as RTC clock source.

         (#) PLL , The RCC features three independent PLLs (clocked by HSI , HSE or MSI),
             featuring three different output clocks and able  to work either in integer or Fractional mode.
           (++) A main PLL, PLL1, which is generally used to provide clocks to the CPU
                and to some peripherals via the ICx mux.
           (++) Two dedicated PLLs, PLL2 and PLL3, which are used to generate the kernel clock for peripherals.

         (#) HSE CSS (Clock security system), once enabled and if a HSE clock failure occurs
            (HSE used directly or through PLL as System clock source), the System clock
             is automatically switched to HSI and an interrupt is generated if enabled.
             The interrupt is linked to the Cortex-M NMI (Non-Maskable Interrupt)
             exception vector.

         (#) LSE CSS (Clock security system), once enabled and if a LSE clock failure occurs
             the LSE is no more provided to RTC, it allows to wake-up from standby mode and protect the
             backup registers and BKPSRAM via TAMP. The LSE CSS may be re-armed for further attempt(s) to use LSE.

         (#) MCO1 (micro controller clock output), used to output HSI, LSE, HSE, LSI, MSI, CPU (SYSA), IC5 mux
             or IC10 mux clock (through a configurable pre-scaler) on PA8 pin.

         (#) MCO2 (micro controller clock output), used to output HSI, LSE, HSE, LSI, MSI, System Bus (SYSB),
             IC15 mux or IC20 mux clock (through a configurable pre-scaler) on PC9 pin.

    [..] CPU, System bus, AHB and APB buses clocks configuration
         (#) Several clock sources can be used to drive independently the CPU (CPUCLK) and System bus clock (SYSCLK):
             HSI, MSI, HSE or ICx mux.
             The AHB clock (HCLK) is derived from System core clock through configurable
             pre-scaler and used to clock the CPU, memory and peripherals mapped
             on AHB and APB bus through configurable pre-scalers
             and used to clock the peripherals mapped on these buses. You can use
             "HAL_RCC_GetSysClockFreq()" function to retrieve system clock frequency.

         -@- All the peripheral clocks are derived from the System bus clock (SYSCLK).

@endverbatim
  * @{
  */

/**
  * @brief  Resets the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - HSI ON and used as CPU and system clock source
  *            - MSI and HSE OFF
  *            - PLL1, PLL2, PLL3 and PLL4 bypassed
  *            - AHB, APB Bus prescalers set to 1
  *            - CSS, MCO1 and MCO2 OFF
  *            - All interrupts disabled
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks
  *            - Memory clocks
  *            - Misc clocks
  *            - LSI, LSE and RTC clocks
  *            - ICx selections and dividers
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_DeInit(void)
{
  uint32_t tickstart;

  /* Disable all interrupts except default one */
  WRITE_REG(RCC->CIER, RCC_CIER_HSECSSIE);

  /* Clear all interrupts flags */
  WRITE_REG(RCC->CICR, RCC_CICR_LSIRDYC | RCC_CICR_LSERDYC | RCC_CICR_MSIRDYC | RCC_CICR_HSIRDYC | RCC_CICR_HSERDYC | \
            RCC_CICR_PLL1RDYC | RCC_CICR_PLL2RDYC | RCC_CICR_PLL3RDYC | RCC_CICR_PLL4RDYC | \
            RCC_CICR_LSECSSC | RCC_CICR_HSECSSC | RCC_CICR_WKUPFC);

  /* Clear reset source flags */
  SET_BIT(RCC->RSR, RCC_RSR_RMVF);

  /* Restore default HSI */
  LL_RCC_HSI_SetDivider(LL_RCC_HSI_DIV_1);
  LL_RCC_HSI_Enable();

  /* Get Start Tick */
  tickstart = HAL_GetTick();

  /* Wait for HSI READY bit */
  while (LL_RCC_HSI_IsReady() == 0U)
  {
    if ((HAL_GetTick() - tickstart) > RCC_HSI_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Reset CFGR1 register to select HSI as CPU and system bus clock */
  CLEAR_REG(RCC->CFGR1);

  /* Get Start Tick */
  tickstart = HAL_GetTick();

  /* Wait till clock switch is ready */
  while (READ_BIT(RCC->CFGR1, (RCC_CFGR1_CPUSWS | RCC_CFGR1_SYSSWS)) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > RCC_CLOCKSWITCH_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Update the SystemCoreClock variable */
  SystemCoreClock = HSI_VALUE;

  /* Adapt Systick interrupt period */
  if (HAL_InitTick(uwTickPrio) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* Reset PLL1 registers to default value */
  WRITE_REG(RCC->PLL1CFGR1, 0x08202500U);
  WRITE_REG(RCC->PLL1CFGR2, 0x00800000U);
  WRITE_REG(RCC->PLL1CFGR3, 0x4900000DU);
  /* Reset PLL2 registers to default value */
  WRITE_REG(RCC->PLL2CFGR1, 0x08000000U);
  WRITE_REG(RCC->PLL2CFGR2, 0x00000000U);
  WRITE_REG(RCC->PLL2CFGR3, 0x49000005U);
  /* Reset PLL3 registers to default value */
  WRITE_REG(RCC->PLL3CFGR1, 0x08000000U);
  WRITE_REG(RCC->PLL3CFGR2, 0x00000000U);
  WRITE_REG(RCC->PLL3CFGR3, 0x49000005U);
  /* Reset PLL4 registers to default value */
  WRITE_REG(RCC->PLL4CFGR1, 0x08000000U);
  WRITE_REG(RCC->PLL4CFGR2, 0x00000000U);
  WRITE_REG(RCC->PLL4CFGR3, 0x49000005U);

  /* Reset MSION, HSEON, PLL1ON, PLL2ON, PLL3ON and PLL4ON bits */
  WRITE_REG(RCC->CCR, RCC_CCR_MSIONC | RCC_CCR_HSEONC | \
            RCC_CCR_PLL1ONC | RCC_CCR_PLL2ONC | RCC_CCR_PLL3ONC | RCC_CCR_PLL4ONC);

  /* Get Start Tick */
  tickstart = HAL_GetTick();

  /* Wait for all PLL ready bits to be reset */
  while (READ_BIT(RCC->SR, (RCC_SR_PLL1RDY | RCC_SR_PLL2RDY | RCC_SR_PLL3RDY | RCC_SR_PLL4RDY)) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > RCC_PLL_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  /* Reset prescalers in CFGR2 register to default values*/
  WRITE_REG(RCC->CFGR2, 0x00100000U);

  /* Reset MSICFGR register */
  CLEAR_REG(RCC->MSICFGR);

  /* Reset HSIMCR register to default value */
  WRITE_REG(RCC->HSIMCR, 0x001F07A1U);

  /* Reset HSECFGR register to default value */
  WRITE_REG(RCC->HSECFGR, 0x00000800U);

