micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc.c
  /*-------------------------- PCLK1 Configuration ---------------------------*/
  if (((pRCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_PCLK1) == RCC_CLOCKTYPE_PCLK1)
  {
    assert_param(IS_RCC_PCLK1(pRCC_ClkInitStruct->APB1CLKDivider));
    if ((pRCC_ClkInitStruct->APB1CLKDivider) < (RCC->CFGR2 & RCC_CFGR2_PPRE1))
    {
      MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE1, (pRCC_ClkInitStruct->APB1CLKDivider));
    }
  }

  /*-------------------------- PCLK2 Configuration ---------------------------*/
  if (((pRCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_PCLK2) == RCC_CLOCKTYPE_PCLK2)
  {
    assert_param(IS_RCC_PCLK2(pRCC_ClkInitStruct->APB2CLKDivider));
    if ((pRCC_ClkInitStruct->APB2CLKDivider) < (RCC->CFGR2 & RCC_CFGR2_PPRE2))
    {
      MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE2, (pRCC_ClkInitStruct->APB2CLKDivider));
    }
  }

  /*-------------------------- PCLK4 Configuration ---------------------------*/
  if (((pRCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_PCLK4) == RCC_CLOCKTYPE_PCLK4)
  {
    assert_param(IS_RCC_PCLK4(pRCC_ClkInitStruct->APB4CLKDivider));
    if ((pRCC_ClkInitStruct->APB4CLKDivider) < (RCC->CFGR2 & RCC_CFGR2_PPRE4))
    {
      MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE4, (pRCC_ClkInitStruct->APB4CLKDivider));
    }
  }

  /*-------------------------- PCLK5 Configuration ---------------------------*/
  if (((pRCC_ClkInitStruct->ClockType) & RCC_CLOCKTYPE_PCLK5) == RCC_CLOCKTYPE_PCLK5)
  {
    assert_param(IS_RCC_PCLK5(pRCC_ClkInitStruct->APB5CLKDivider));
    if ((pRCC_ClkInitStruct->APB5CLKDivider) < (RCC->CFGR2 & RCC_CFGR2_PPRE5))
    {
      MODIFY_REG(RCC->CFGR2, RCC_CFGR2_PPRE5, (pRCC_ClkInitStruct->APB5CLKDivider));
    }
  }

  /* Configure the source of time base considering new system clocks settings*/
  return HAL_InitTick(uwTickPrio);
}

/**
  * @}
  */

/** @defgroup RCC_Group2 Peripheral Control functions
  *  @brief   RCC clocks control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the RCC Clocks
    frequencies.

@endverbatim
  * @{
  */

/**
  * @brief  Selects the clock source to output on MCO1 pin(PA8) or on MCO2 pin(PC9).
  * @note   PWR VDDIO4 Input Independent I/O supply 4 shall be previously set up for PC9
  *         with HAL_PWREx_EnableVddIO4()
  * @note   The MCO switch to the new clock source only occurs when the previous clock source is active
  *         (dynamic switch).
  * @param  RCC_MCOx specifies the output direction for the clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCO1 Clock source to output on MCO1 pin(PA8).
  *            @arg RCC_MCO2 Clock source to output on MCO2 pin(PC9).
  * @param  RCC_MCOSource specifies the clock source to output.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCO1SOURCE_LSI LSI clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_LSE LSE clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_MSI MSI clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_HSI HSI clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_HSE HSE clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_IC5 IC5 clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_IC10 IC10 clock selected as MCO1 source
  *            @arg RCC_MCO1SOURCE_SYSA CPU clock (SYSA) selected as MCO1 source
  *            @arg RCC_MCO2SOURCE_LSI LSI clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_LSE LSE clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_MSI MSI clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_HSI HSI clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_HSE HSE clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_IC15 IC15 clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_IC20 IC20 clock selected as MCO2 source
  *            @arg RCC_MCO2SOURCE_SYSB Bus clock (SYSB) selected as MCO2 source
  * @param  RCC_MCODiv specifies the MCOx pre-scaler.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCODIV_1 up to RCC_MCODIV_16  : divider applied to MCOx clock
  * @retval None
  */
void HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Check the parameters */
  assert_param(IS_RCC_MCO(RCC_MCOx));
  assert_param(IS_RCC_MCODIV(RCC_MCODiv));

  /* RCC_MCO1 */
  if (RCC_MCOx == RCC_MCO1)
  {
    assert_param(IS_RCC_MCO1SOURCE(RCC_MCOSource));

    /* MCO1 Clock Enable */
    RCC_MCO1_CLK_ENABLE();

    /* Configure the MCO1 pin in alternate function mode */
    GPIO_InitStruct.Pin = RCC_MCO1_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    HAL_GPIO_Init(RCC_MCO1_GPIO_PORT, &GPIO_InitStruct);

    /* Configure MCO1 */
    LL_RCC_ConfigMCO(RCC_MCOSource, RCC_MCODiv);

    /* Enable IC5 if requested as source to MCO1 */
    if (RCC_MCOSource == RCC_MCO1SOURCE_IC5)
    {
      LL_RCC_IC5_Enable();
    }
    /* Enable IC10 if requested as source to MCO1 */
    else if (RCC_MCOSource == RCC_MCO1SOURCE_IC10)
    {
      LL_RCC_IC10_Enable();
    }
    else
    {
      /* Nothing to do as not ICx source */
    }
    /* Enable MC01 output */
    LL_RCC_EnableMCO(LL_RCC_MCO1);
  }
  else
  {
    assert_param(IS_RCC_MCO2SOURCE(RCC_MCOSource));

    /* MCO2 Clock Enable */
    RCC_MCO2_CLK_ENABLE();

    /* Configure the MCO2 pin in alternate function mode */
    GPIO_InitStruct.Pin = RCC_MCO2_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    HAL_GPIO_Init(RCC_MCO2_GPIO_PORT, &GPIO_InitStruct);

    /* Configure MCO2 */
    LL_RCC_ConfigMCO(RCC_MCOSource, ((RCC_CCIPR5_MCO2PRE << 16U) | ((RCC_MCODiv & RCC_CCIPR5_MCO1PRE) << 8U)));

    /* Enable IC15 if requested as source to MCO2 */
    if (RCC_MCOSource == RCC_MCO2SOURCE_IC15)
    {
      LL_RCC_IC15_Enable();
    }
    /* Enable IC20 if requested as source to MCO2 */
    else if (RCC_MCOSource == RCC_MCO2SOURCE_IC20)
    {
      LL_RCC_IC20_Enable();
    }
    else
    {
      /* Nothing to do as not ICx source */
    }
    /* Enable MC02 output */
    LL_RCC_EnableMCO(LL_RCC_MCO2);
  }
}

/**
  * @brief  Enable the HSE Clock Security System.
  * @note   If a failure is detected on the HSE oscillator clock, this oscillator
  *         is automatically disabled and an interrupt is generated to inform the
  *         software about the failure (Clock Security System Interrupt, CSSI),
  *         allowing the MCU to perform rescue operations. The CSSI is linked to
  *         the Cortex-M NMI (Non-Mask-able Interrupt) exception vector.
  * @note   The HSE Clock Security System may be enabled even if the HSE is not enabled
  *         but will be activated when the HSE is enabled and ready.
  * @note   It is not possible to disable the HSE Clock Security System.
  * @retval None
  */
void HAL_RCC_EnableCSS(void)
{
  LL_RCC_HSE_EnableCSS();
}

/**
  * @brief  Returns the CPU clock (sysa_ck) frequency
  *
  * @note   The CPU clock frequency computed by this function may be not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note     If CPUCLK source is HSI, function returns values based on HSI_VALUE(**)
  * @note     If CPUCLK source is MSI, function returns values based on MSI_VALUE(*)
  * @note     If CPUCLK source is HSE, function returns values based on HSE_VALUE(***)
  * @note     If CPUCLK source is IC1, function returns values based on HSI_VALUE(*),
  *           MSI_VALUE(**) or HSE_VALUE(***) multiplied/divided by the PLL factors.
  * @note     (*) HSI_VALUE is a constant defined in stm32n6xx_hal_conf.h file (default value
  *               64 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) MSI_VALUE is a constant defined in stm32n6xx_hal_conf.h file (default value
  *               4 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (***) HSE_VALUE is a constant defined in stm32n6xx_hal_conf.h file (default value
  *                25 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  *
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *
  * @note   This function can be used by the user application to compute the
  *         baud rate for the communication peripherals or configure other parameters.
  *
  * @note   Each time CPUCLK changes, this function must be called by the user application
  *         to update the CPUCLK value. Otherwise, any configuration based on this function
  *         will be incorrect.
  *
  * @retval CPUCLK frequency
  */
uint32_t HAL_RCC_GetCpuClockFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t ic_divider;

