micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc.c
  /* Get CPUCLK source -------------------------------------------------------*/
  switch (LL_RCC_GetCpuClkSource())
  {
    /* No check on Ready: Won't be selected by hardware if not */
    case LL_RCC_CPU_CLKSOURCE_STATUS_HSI:
      frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      break;

    case LL_RCC_CPU_CLKSOURCE_STATUS_MSI:
      if (LL_RCC_MSI_GetFrequency() == LL_RCC_MSI_FREQ_4MHZ)
      {
        frequency = MSI_VALUE;
      }
      else
      {
        frequency = 16000000UL;
      }
      break;

    case LL_RCC_CPU_CLKSOURCE_STATUS_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_CPU_CLKSOURCE_STATUS_IC1:
      ic_divider = LL_RCC_IC1_GetDivider();
      switch (LL_RCC_IC1_GetSource())
      {
        case LL_RCC_ICCLKSOURCE_PLL1:
          frequency = HAL_RCCEx_GetPLL1CLKFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL2:
          frequency = HAL_RCCEx_GetPLL2CLKFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL3:
          frequency = HAL_RCCEx_GetPLL3CLKFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL4:
          frequency = HAL_RCCEx_GetPLL4CLKFreq();
          frequency = frequency / ic_divider;
          break;
        default:
          /* Unexpected case */
          break;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Returns the SYSCLK bus (sysb_ck) frequency
  *
  * @note   The system bus frequency computed by this function may be not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE(**)
  * @note     If SYSCLK source is MSI, function returns values based on MSI_VALUE(*)
  * @note     If SYSCLK source is HSE, function returns values based on HSE_VALUE(***)
  * @note     If SYSCLK source is IC2, function returns values based on HSI_VALUE(*),
  *           MSI_VALUE(**) or HSE_VALUE(***) multiplied/divided by the PLL factors.
  * @note     (*) HSI_VALUE is a constant defined in stm32n6xx_hal_conf.h file (default value
  *               64 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) MSI_VALUE is a constant defined in stm32n6xx_hal_conf.h file (default value
  *               4 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (***) HSE_VALUE is a constant defined in stm32n6xx_hal_conf.h file (default value
  *                25 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  *
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *
  * @note   This function can be used by the user application to compute the
  *         baud rate for the communication peripherals or configure other parameters.
  *
  * @note   Each time SYSCLK changes, this function must be called by the user application
  *         to update the SYSCLK value. Otherwise, any configuration based on this function
  *         will be incorrect.
  *
  * @retval SYSCLK frequency
  */
uint32_t HAL_RCC_GetSysClockFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t ic_divider;

  /* Get SYSCLK source -------------------------------------------------------*/
  switch (LL_RCC_GetSysClkSource())
  {
    /* No check on Ready: Won't be selected by hardware if not */
    case LL_RCC_SYS_CLKSOURCE_STATUS_HSI:
      frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_MSI:
      if (LL_RCC_MSI_GetFrequency() == LL_RCC_MSI_FREQ_4MHZ)
      {
        frequency = MSI_VALUE;
      }
      else
      {
        frequency = 16000000UL;
      }
      break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_IC2_IC6_IC11:
      ic_divider = LL_RCC_IC2_GetDivider();
      switch (LL_RCC_IC2_GetSource())
      {
        case LL_RCC_ICCLKSOURCE_PLL1:
          frequency = HAL_RCCEx_GetPLL1CLKFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL2:
          frequency = HAL_RCCEx_GetPLL2CLKFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL3:
          frequency = HAL_RCCEx_GetPLL3CLKFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL4:
          frequency = HAL_RCCEx_GetPLL4CLKFreq();
          frequency = frequency / ic_divider;
          break;
        default:
          /* Unexpected case */
          break;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return the HCLK frequency.
  * @retval HCLK frequency in Hz
  */
uint32_t HAL_RCC_GetHCLKFreq(void)
{
  return LL_RCC_CALC_HCLK_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHBPrescaler());
}

/**
  * @brief  Return the PCLK1 frequency.
  * @note   Each time PCLK1 changes, this function must be called to update the
  *         right PCLK1 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK1 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK1Freq(void)
{
  return LL_RCC_CALC_PCLK1_FREQ(LL_RCC_CALC_HCLK_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHBPrescaler()),
                                LL_RCC_GetAPB1Prescaler());
}

/**
  * @brief  Return the PCLK2 frequency.
  * @note   Each time PCLK2 changes, this function must be called to update the
  *         right PCLK2 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK2 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK2Freq(void)
{
  return LL_RCC_CALC_PCLK2_FREQ(LL_RCC_CALC_HCLK_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHBPrescaler()),
                                LL_RCC_GetAPB2Prescaler());
}

/**
  * @brief  Return the PCLK4 frequency.
  * @note   Each time PCLK4 changes, this function must be called to update the
  *         right PCLK4 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK4 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK4Freq(void)
{
  return LL_RCC_CALC_PCLK4_FREQ(LL_RCC_CALC_HCLK_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHBPrescaler()),
                                LL_RCC_GetAPB4Prescaler());
}

/**
  * @brief  Return the PCLK5 frequency.
  * @note   Each time PCLK5 changes, this function must be called to update the
  *         right PCLK5 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK5 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK5Freq(void)
{
  return LL_RCC_CALC_PCLK5_FREQ(LL_RCC_CALC_HCLK_FREQ(HAL_RCC_GetSysClockFreq(), LL_RCC_GetAHBPrescaler()),
                                LL_RCC_GetAPB5Prescaler());
}

/**
  * @brief  Get the oscillators status configuration in RCC_OscInitStruct according to
  *         the internal RCC configuration registers.
  * @param  pRCC_OscInitStruct  Pointer to an RCC_OscInitTypeDef structure that
  *         will return the configuration.
  * @retval None
  */
void HAL_RCC_GetOscConfig(RCC_OscInitTypeDef  *pRCC_OscInitStruct)
{
  uint32_t sr_value;
  uint32_t cfgr_value;

  /* Get the status register value */
  sr_value = RCC->SR;

  /* Set all possible values for the Oscillator type parameters --------------*/
  pRCC_OscInitStruct->OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_MSI | \
                                       RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_LSI;

  /* Get the HSE configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_HSERDY) != 0UL)
  {
    cfgr_value = RCC->HSECFGR;
    if ((cfgr_value & (RCC_HSECFGR_HSEBYP | RCC_HSECFGR_HSEEXT)) == RCC_HSECFGR_HSEBYP)
    {
      pRCC_OscInitStruct->HSEState = RCC_HSE_BYPASS;
    }
    else if ((cfgr_value & (RCC_HSECFGR_HSEBYP | RCC_HSECFGR_HSEEXT)) == (RCC_HSECFGR_HSEBYP | RCC_HSECFGR_HSEEXT))
    {
      pRCC_OscInitStruct->HSEState = RCC_HSE_BYPASS_DIGITAL;
    }
    else
    {
      pRCC_OscInitStruct->HSEState = RCC_HSE_ON;
    }
  }
  else
  {
    pRCC_OscInitStruct->HSEState = RCC_HSE_OFF;
  }

  /* Get the MSI configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_MSIRDY) != 0UL)
  {
    pRCC_OscInitStruct->MSIState = RCC_MSI_ON;
  }
  else
  {
    pRCC_OscInitStruct->MSIState = RCC_MSI_OFF;
  }

  cfgr_value = RCC->MSICFGR;
  pRCC_OscInitStruct->MSIFrequency = (cfgr_value & RCC_MSICFGR_MSIFREQSEL);
  pRCC_OscInitStruct->MSICalibrationValue = ((cfgr_value & RCC_MSICFGR_MSITRIM) >> RCC_MSICFGR_MSITRIM_Pos);

  /* Get the HSI configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_HSIRDY) != 0UL)
  {
    pRCC_OscInitStruct->HSIState = RCC_HSI_ON;
  }
  else
  {
    pRCC_OscInitStruct->HSIState = RCC_HSI_OFF;
  }

  cfgr_value = RCC->HSICFGR;
  pRCC_OscInitStruct->HSIDiv = (cfgr_value & RCC_HSICFGR_HSIDIV);
  pRCC_OscInitStruct->HSICalibrationValue = ((cfgr_value & RCC_HSICFGR_HSITRIM) >> RCC_HSICFGR_HSITRIM_Pos);

