micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc.c
  /* Get the LSE configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_LSERDY) != 0UL)
  {
    cfgr_value = RCC->LSECFGR;
    if ((cfgr_value & (RCC_LSECFGR_LSEBYP | RCC_LSECFGR_LSEEXT)) == RCC_LSECFGR_LSEBYP)
    {
      pRCC_OscInitStruct->LSEState = RCC_LSE_BYPASS;
    }
    else if ((cfgr_value & (RCC_LSECFGR_LSEBYP | RCC_LSECFGR_LSEEXT)) == (RCC_LSECFGR_LSEBYP | RCC_LSECFGR_LSEEXT))
    {
      pRCC_OscInitStruct->LSEState = RCC_LSE_BYPASS_DIGITAL;
    }
    else
    {
      pRCC_OscInitStruct->LSEState = RCC_LSE_ON;
    }
  }
  else
  {
    pRCC_OscInitStruct->LSEState = RCC_LSE_OFF;
  }

  /* Get the LSI configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_LSIRDY) != 0UL)
  {
    pRCC_OscInitStruct->LSIState = RCC_LSI_ON;
  }
  else
  {
    pRCC_OscInitStruct->LSIState = RCC_LSI_OFF;
  }

  /* Get the PLL1 configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_PLL1RDY) != 0UL)
  {
    cfgr_value = RCC->PLL1CFGR1;
    pRCC_OscInitStruct->PLL1.PLLState = RCC_PLL_ON;
    pRCC_OscInitStruct->PLL1.PLLSource = (cfgr_value & RCC_PLL1CFGR1_PLL1SEL);
    pRCC_OscInitStruct->PLL1.PLLM = ((cfgr_value & RCC_PLL1CFGR1_PLL1DIVM) >> RCC_PLL1CFGR1_PLL1DIVM_Pos);
    pRCC_OscInitStruct->PLL1.PLLN = ((cfgr_value & RCC_PLL1CFGR1_PLL1DIVN) >> RCC_PLL1CFGR1_PLL1DIVN_Pos);
    pRCC_OscInitStruct->PLL1.PLLFractional = (READ_BIT(RCC->PLL1CFGR2, RCC_PLL1CFGR2_PLL1DIVNFRAC) >> \
                                              RCC_PLL1CFGR2_PLL1DIVNFRAC_Pos);
    cfgr_value = RCC->PLL1CFGR3;
    pRCC_OscInitStruct->PLL1.PLLP1 = ((cfgr_value & RCC_PLL1CFGR3_PLL1PDIV1) >> RCC_PLL1CFGR3_PLL1PDIV1_Pos);
    pRCC_OscInitStruct->PLL1.PLLP2 = ((cfgr_value & RCC_PLL1CFGR3_PLL1PDIV2) >> RCC_PLL1CFGR3_PLL1PDIV2_Pos);
  }
  else
  {
    cfgr_value = RCC->PLL1CFGR1;
    if ((cfgr_value & RCC_PLL1CFGR1_PLL1BYP) != 0UL)
    {
      pRCC_OscInitStruct->PLL1.PLLState = RCC_PLL_BYPASS;
    }
    else
    {
      pRCC_OscInitStruct->PLL1.PLLState = RCC_PLL_OFF;
    }
  }

  /* Get the PLL2 configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_PLL2RDY) != 0UL)
  {
    cfgr_value = RCC->PLL2CFGR1;
    pRCC_OscInitStruct->PLL2.PLLState = RCC_PLL_ON;
    pRCC_OscInitStruct->PLL2.PLLSource = (cfgr_value & RCC_PLL2CFGR1_PLL2SEL);
    pRCC_OscInitStruct->PLL2.PLLM = ((cfgr_value & RCC_PLL2CFGR1_PLL2DIVM) >> RCC_PLL2CFGR1_PLL2DIVM_Pos);
    pRCC_OscInitStruct->PLL2.PLLN = ((cfgr_value & RCC_PLL2CFGR1_PLL2DIVN) >> RCC_PLL2CFGR1_PLL2DIVN_Pos);
    pRCC_OscInitStruct->PLL2.PLLFractional = (READ_BIT(RCC->PLL2CFGR2, RCC_PLL2CFGR2_PLL2DIVNFRAC) >> \
                                              RCC_PLL2CFGR2_PLL2DIVNFRAC_Pos);
    cfgr_value = RCC->PLL2CFGR3;
    pRCC_OscInitStruct->PLL2.PLLP1 = ((cfgr_value & RCC_PLL2CFGR3_PLL2PDIV1) >> RCC_PLL2CFGR3_PLL2PDIV1_Pos);
    pRCC_OscInitStruct->PLL2.PLLP2 = ((cfgr_value & RCC_PLL2CFGR3_PLL2PDIV2) >> RCC_PLL2CFGR3_PLL2PDIV2_Pos);
  }
  else
  {
    cfgr_value = RCC->PLL2CFGR1;
    if ((cfgr_value & RCC_PLL2CFGR1_PLL2BYP) != 0UL)
    {
      pRCC_OscInitStruct->PLL2.PLLState = RCC_PLL_BYPASS;
    }
    else
    {
      pRCC_OscInitStruct->PLL2.PLLState = RCC_PLL_OFF;
    }
  }

  /* Get the PLL3 configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_PLL3RDY) != 0UL)
  {
    cfgr_value = RCC->PLL3CFGR1;
    pRCC_OscInitStruct->PLL3.PLLState = RCC_PLL_ON;
    pRCC_OscInitStruct->PLL3.PLLSource = (cfgr_value & RCC_PLL3CFGR1_PLL3SEL);
    pRCC_OscInitStruct->PLL3.PLLM = ((cfgr_value & RCC_PLL3CFGR1_PLL3DIVM) >> RCC_PLL3CFGR1_PLL3DIVM_Pos);
    pRCC_OscInitStruct->PLL3.PLLN = ((cfgr_value & RCC_PLL3CFGR1_PLL3DIVN) >> RCC_PLL3CFGR1_PLL3DIVN_Pos);
    pRCC_OscInitStruct->PLL3.PLLFractional = (READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_PLL3DIVNFRAC) >> \
                                              RCC_PLL3CFGR2_PLL3DIVNFRAC_Pos);
    cfgr_value = RCC->PLL3CFGR3;
    pRCC_OscInitStruct->PLL3.PLLP1 = ((cfgr_value & RCC_PLL3CFGR3_PLL3PDIV1) >> RCC_PLL3CFGR3_PLL3PDIV1_Pos);
    pRCC_OscInitStruct->PLL3.PLLP2 = ((cfgr_value & RCC_PLL3CFGR3_PLL3PDIV2) >> RCC_PLL3CFGR3_PLL3PDIV2_Pos);
  }
  else
  {
    cfgr_value = RCC->PLL3CFGR1;
    if ((cfgr_value & RCC_PLL3CFGR1_PLL3BYP) != 0UL)
    {
      pRCC_OscInitStruct->PLL3.PLLState = RCC_PLL_BYPASS;
    }
    else
    {
      pRCC_OscInitStruct->PLL3.PLLState = RCC_PLL_OFF;
    }
  }

  /* Get the PLL4 configuration -----------------------------------------------*/
  if ((sr_value & RCC_SR_PLL4RDY) != 0UL)
  {
    cfgr_value = RCC->PLL4CFGR1;
    pRCC_OscInitStruct->PLL4.PLLState = RCC_PLL_ON;
    pRCC_OscInitStruct->PLL4.PLLSource = (cfgr_value & RCC_PLL4CFGR1_PLL4SEL);
    pRCC_OscInitStruct->PLL4.PLLM = ((cfgr_value & RCC_PLL4CFGR1_PLL4DIVM) >> RCC_PLL4CFGR1_PLL4DIVM_Pos);
    pRCC_OscInitStruct->PLL4.PLLN = ((cfgr_value & RCC_PLL4CFGR1_PLL4DIVN) >> RCC_PLL4CFGR1_PLL4DIVN_Pos);
    pRCC_OscInitStruct->PLL4.PLLFractional = (READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_PLL4DIVNFRAC) >> \
                                              RCC_PLL4CFGR2_PLL4DIVNFRAC_Pos);
    cfgr_value = RCC->PLL4CFGR3;
    pRCC_OscInitStruct->PLL4.PLLP1 = ((cfgr_value & RCC_PLL4CFGR3_PLL4PDIV1) >> RCC_PLL4CFGR3_PLL4PDIV1_Pos);
    pRCC_OscInitStruct->PLL4.PLLP2 = ((cfgr_value & RCC_PLL4CFGR3_PLL4PDIV2) >> RCC_PLL4CFGR3_PLL4PDIV2_Pos);
  }
  else
  {
    cfgr_value = RCC->PLL4CFGR1;
    if ((cfgr_value & RCC_PLL4CFGR1_PLL4BYP) != 0UL)
    {
      pRCC_OscInitStruct->PLL4.PLLState = RCC_PLL_BYPASS;
    }
    else
    {
      pRCC_OscInitStruct->PLL4.PLLState = RCC_PLL_OFF;
    }
  }
}

/**
  * @brief  Get the clocks status configuration in RCC_ClkInitStruct according to
  *         the internal RCC configuration registers.
  * @param  pRCC_ClkInitStruct  Pointer to an RCC_ClkInitTypeDef structure that
  *         will return the configuration.
  * @retval None
  */
void HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *pRCC_ClkInitStruct)
{
  uint32_t cfgr_value;

  /* Set all possible values for the Clock type parameter --------------------*/
  pRCC_ClkInitStruct->ClockType = RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK | \
                                  RCC_CLOCKTYPE_HCLK   | \
                                  RCC_CLOCKTYPE_PCLK1  | RCC_CLOCKTYPE_PCLK2 | \
                                  RCC_CLOCKTYPE_PCLK4  | RCC_CLOCKTYPE_PCLK5;

  /* Get the configuration register 1 value */
  cfgr_value = RCC->CFGR1;

  /* Get the active CPU source -----------------------------------------------*/
  pRCC_ClkInitStruct->CPUCLKSource = (cfgr_value & RCC_CFGR1_CPUSWS) >> 4U;

  /* Get the active SYSCLK bus source ----------------------------------------*/
  pRCC_ClkInitStruct->SYSCLKSource = (cfgr_value & RCC_CFGR1_SYSSWS) >> 4U;

