micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc.c
  /* Get the configuration register 2 value */
  cfgr_value = RCC->CFGR2;

  /* Get the HCLK configuration ----------------------------------------------*/
  pRCC_ClkInitStruct->AHBCLKDivider = (cfgr_value & RCC_CFGR2_HPRE);

  /* Get the APB1 configuration ----------------------------------------------*/
  pRCC_ClkInitStruct->APB1CLKDivider = (cfgr_value & RCC_CFGR2_PPRE1);

  /* Get the APB2 configuration ----------------------------------------------*/
  pRCC_ClkInitStruct->APB2CLKDivider = (cfgr_value & RCC_CFGR2_PPRE2);

  /* Get the APB4 configuration ----------------------------------------------*/
  pRCC_ClkInitStruct->APB4CLKDivider = (cfgr_value & RCC_CFGR2_PPRE4);

  /* Get the APB5 configuration ----------------------------------------------*/
  pRCC_ClkInitStruct->APB5CLKDivider = (cfgr_value & RCC_CFGR2_PPRE5);

  /* Get the IC1 configuration -----------------------------------------------*/
  cfgr_value = RCC->IC1CFGR;
  pRCC_ClkInitStruct->IC1Selection.ClockSelection = cfgr_value & RCC_IC1CFGR_IC1SEL;
  pRCC_ClkInitStruct->IC1Selection.ClockDivider = ((cfgr_value & RCC_IC1CFGR_IC1INT) >> RCC_IC1CFGR_IC1INT_Pos) + 1U;

  /* Get the IC2 configuration -----------------------------------------------*/
  cfgr_value = RCC->IC2CFGR;
  pRCC_ClkInitStruct->IC2Selection.ClockSelection = cfgr_value & RCC_IC2CFGR_IC2SEL;
  pRCC_ClkInitStruct->IC2Selection.ClockDivider = ((cfgr_value & RCC_IC2CFGR_IC2INT) >> RCC_IC2CFGR_IC2INT_Pos) + 1U;

  /* Get the IC6 configuration -----------------------------------------------*/
  cfgr_value = RCC->IC6CFGR;
  pRCC_ClkInitStruct->IC6Selection.ClockSelection = cfgr_value & RCC_IC6CFGR_IC6SEL;
  pRCC_ClkInitStruct->IC6Selection.ClockDivider = ((cfgr_value & RCC_IC6CFGR_IC6INT) >> RCC_IC6CFGR_IC6INT_Pos) + 1U;

  /* Get the IC11 configuration ----------------------------------------------*/
  cfgr_value = RCC->IC11CFGR;
  pRCC_ClkInitStruct->IC11Selection.ClockSelection = cfgr_value & RCC_IC11CFGR_IC11SEL;
  pRCC_ClkInitStruct->IC11Selection.ClockDivider = ((cfgr_value & RCC_IC11CFGR_IC11INT) >> RCC_IC11CFGR_IC11INT_Pos) + 1U;
}

/**
  * @brief This function handles the RCC HSE CSS interrupt request.
  * @note This API should be called under the NMI_Handler().
  * @retval None
  */
void HAL_RCC_NMI_IRQHandler(void)
{
  /* Check RCC HCECSSF interrupt flag  */
  if (LL_RCC_IsActiveFlag_HSECSS() == 1U)
  {
    /* Clear RCC HSE Clock Security System pending flag */
    LL_RCC_ClearFlag_HSECSS();

    /* RCC HSE Clock Security System interrupt user callback */
    HAL_RCC_CSSCallback();
  }
}

/**
  * @brief  RCC HSE Clock Security System interrupt callback
  * @retval none
  */
__weak void HAL_RCC_CSSCallback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_RCC_CSSCallback could be implemented in the user file
   */
}

/**
  * @}
  */


/** @defgroup RCC_Exported_Functions_Group3 Attributes management functions
  *  @brief Attributes management functions.
  *
@verbatim
 ===============================================================================
                       ##### RCC attributes functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to:

    (+) Configure the RCC item(s) attribute(s).
    (+) Get the attribute of an RCC item.

@endverbatim
  * @{
  */

/**
  * @brief  Configure the RCC item(s) attribute(s).
  * @note   Available attributes are to control the secure, privileged, public and lock access rights of items.
  *         Default access rights are non-secure, unprivileged, non-public and unlocked.
  * @note   Secure/non-secure, privileged/unprivileged and public/non-public attributes can be set and reset
  *         from the secure/privileged state only.
  * @note   Lock Item attribute can be set from the secure/privileged state only.
  * @param  Item Item(s) to set attributes on.
  *         This parameter can be a one value or a combination of @ref RCC_items belonging to the same group of items
  *         (eg. RCC_ITEM_GROUP_OSC)
  * @param  Attributes specifies the RCC secure/privilege/public attributes.
  *         This parameter can be a combination of @ref RCC_attributes
  * @retval None
  *
  */
void HAL_RCC_ConfigAttributes(uint32_t Item, uint32_t Attributes)
{
  /* Check the parameters */
  assert_param(IS_RCC_ATTRIBUTES(Attributes));
  assert_param(IS_RCC_ITEM_ATTRIBUTES(Item));

  /* Check then configure items groups */
  /* Oscillators group */
  if ((Item & RCC_ITEM_GROUP_OSC) == RCC_ITEM_GROUP_OSC)
  {
    RCC_ATTR_ConfigItemGroup(RCC_ITEM_GROUP_IDX_OSC, Item & RCC_ITEM_GROUP_OSC_MASK, Attributes);
  }

  /* PLLs group */
  if ((Item & RCC_ITEM_GROUP_PLL) == RCC_ITEM_GROUP_PLL)
  {
    RCC_ATTR_ConfigItemGroup(RCC_ITEM_GROUP_IDX_PLL, Item & RCC_ITEM_GROUP_PLL_MASK, Attributes);
  }

  /* ICxs group */
  if ((Item & RCC_ITEM_GROUP_IC) == RCC_ITEM_GROUP_IC)
  {
    RCC_ATTR_ConfigItemGroup(RCC_ITEM_GROUP_IDX_IC, Item & RCC_ITEM_GROUP_IC_MASK, Attributes);
  }

  /* System configs group */
  if ((Item & RCC_ITEM_GROUP_SYSCFG) == RCC_ITEM_GROUP_SYSCFG)
  {
    RCC_ATTR_ConfigItemGroup(RCC_ITEM_GROUP_IDX_SYSCFG, Item & RCC_ITEM_GROUP_SYSCFG_MASK, Attributes);
  }

  /* Buses group */
  if ((Item & RCC_ITEM_GROUP_BUS) == RCC_ITEM_GROUP_BUS)
  {
    RCC_ATTR_ConfigItemGroup(RCC_ITEM_GROUP_IDX_BUS, Item & RCC_ITEM_GROUP_BUS_MASK, Attributes);
  }

  /* Memories group */
  if ((Item & RCC_ITEM_GROUP_MEM) == RCC_ITEM_GROUP_MEM)
  {
    RCC_ATTR_ConfigItemGroup(RCC_ITEM_GROUP_IDX_MEM, Item & RCC_ITEM_GROUP_MEM_MASK, Attributes);
  }
}

/**
  * @brief  Get the attributes of an RCC item.
  * @note   Secured items are available from non-secure state when set as public
  * @param  Item A single item to get secure/non-secure, public/non-public, privilege/non-privilege and locked
        attributes from. This parameter can be a value of RCC_items.
  * @param  pAttributes pointer to return the attributes (this is a combination of @ref RCC_attributes).
  * @retval HAL Status.
  *
  */
HAL_StatusTypeDef HAL_RCC_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes)
{
  uint32_t attributes = 0UL;

  /* Check null pointer */
  if (pAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_RCC_SINGLE_ITEM_ATTRIBUTES(Item));

  /* Get the item group index and compute the attribute base register address*/
  uint32_t ItemGroup = (Item & RCC_ITEM_GROUP_MASK) >> RCC_ITEM_GROUP_POS;
  uint32_t ItemGroupIdx = 0UL;
  while ((ItemGroup >> ItemGroupIdx) != 1UL)
  {
    ItemGroupIdx++;
  }

  __IO const uint32_t *p_rcc_reg = &(RCC->SECCFGR0) + (0x4UL * ItemGroupIdx);

