micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc.c
  /* Enable the PLLx */
  WRITE_REG(RCC->CSR, RCC_CSR_PLL1ONS << PLLnumber);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait till PLLx is ready */
  while (READ_BIT(RCC->SR, (RCC_SR_PLL1RDY << PLLnumber)) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > RCC_PLL_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  return ret;
}

/**
  * @brief  Check for a new PLL configuration
  * @param  PLLnumber PLL number
  * @param  pPLLInit Pointer to an RCC_PLLInitTypeDef structure that
  *                  contains the configuration parameters.  *
  * @retval 1 if success else 0
  */
static uint32_t RCC_PLL_IsNewConfig(uint32_t PLLnumber, const RCC_PLLInitTypeDef *pPLLInit)
{
  __IO const uint32_t *p_rcc_pll_cfgr1_reg, *p_rcc_pll_cfgr2_reg, *p_rcc_pll_cfgr3_reg;
  uint32_t ret = 0U;

  /* No assert since done in calling function */

  p_rcc_pll_cfgr1_reg = &(RCC->PLL1CFGR1) + (((uint32_t)0x4) * PLLnumber);
  p_rcc_pll_cfgr2_reg = &(RCC->PLL1CFGR2) + (((uint32_t)0x4) * PLLnumber);
  p_rcc_pll_cfgr3_reg = &(RCC->PLL1CFGR3) + (((uint32_t)0x4) * PLLnumber);

  /* !!! WARNING: ONLY INTEGER AND FRACTIONAL MODES MANAGED TODAY !!! */

  /* Check for PLLCFGR1, PLLCFGR2 and PLLCFGR3 parameters updates */
  if ((*p_rcc_pll_cfgr1_reg & (RCC_PLL1CFGR1_PLL1SEL | RCC_PLL1CFGR1_PLL1DIVM | RCC_PLL1CFGR1_PLL1DIVN)) != \
      (pPLLInit->PLLSource | (pPLLInit->PLLM << RCC_PLL1CFGR1_PLL1DIVM_Pos) \
       | (pPLLInit->PLLN << RCC_PLL1CFGR1_PLL1DIVN_Pos)))
  {
    ret = 1U; /* New PLL configuration */
  }
  else if ((*p_rcc_pll_cfgr2_reg & RCC_PLL1CFGR2_PLL1DIVNFRAC) != \
           (pPLLInit->PLLFractional << RCC_PLL1CFGR2_PLL1DIVNFRAC_Pos))
  {
    ret = 1U; /* New PLL configuration */
  }
  else if ((*p_rcc_pll_cfgr3_reg & (RCC_PLL1CFGR3_PLL1PDIV1 | RCC_PLL1CFGR3_PLL1PDIV2)) != \
           ((pPLLInit->PLLP1 << RCC_PLL1CFGR3_PLL1PDIV1_Pos) | (pPLLInit->PLLP2 << RCC_PLL1CFGR3_PLL1PDIV2_Pos)))
  {
    ret = 1U; /* New PLL configuration */
  }
  else
  {
    /* Mode change detection*/
    uint32_t pllState;

    /* Get current Mode*/
    if (READ_BIT(RCC->SR, (RCC_SR_PLL1RDY << PLLnumber)) == (RCC_SR_PLL1RDY << PLLnumber))
    {
      pllState = RCC_PLL_ON;
    }
    else
    {
      if ((*p_rcc_pll_cfgr1_reg & RCC_PLL1CFGR1_PLL1BYP) != 0UL)
      {
        pllState = RCC_PLL_BYPASS;
      }
      else
      {
        pllState = RCC_PLL_OFF;
      }
    }

    /* Compare with new mode */
    if (pllState != pPLLInit->PLLState)
    {
      ret = 1U; /* New PLL configuration */
    }
  }

  return ret;
}

/**
  * @brief  Check whether the PLL source is ready
  * @param  PLLSource PLL source
  * @retval 1 if success else 0
  */
static uint32_t RCC_PLL_Source_IsReady(uint32_t PLLSource)
{
  uint32_t ret = 1U;

  /* No assert since done in calling function */

  switch (PLLSource)
  {
    case RCC_PLLSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() == 0U)
      {
        ret = 0U;
      }
      break;
    case RCC_PLLSOURCE_MSI:
      if (LL_RCC_MSI_IsReady() == 0U)
      {
        ret = 0U;
      }
      break;
    case RCC_PLLSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() == 0U)
      {
        ret = 0U;
      }
      break;
    case RCC_PLLSOURCE_PIN:
    default:
      break;
  }

  return ret;
}

/**
  * @brief  Check whether PLL sources are available
  * @param  PLLSource1 First PLL source
  * @param  PLLSource2 Second PLL source
  * @retval 1 if success else 0
  */
static uint32_t RCC_IC_CheckPLLSources(uint32_t PLLSource1, uint32_t PLLSource2)
{
  uint32_t ret = 1U;

  /* No assert since done in calling function */

  /* Check PLLSource1 clock source */
  switch (PLLSource1)
  {
    case LL_RCC_ICCLKSOURCE_PLL1:
      if (LL_RCC_PLL1_IsReady() == 0U)
      {
        if (LL_RCC_PLL1_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    case LL_RCC_ICCLKSOURCE_PLL2:
      if (LL_RCC_PLL2_IsReady() == 0U)
      {
        if (LL_RCC_PLL2_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    case LL_RCC_ICCLKSOURCE_PLL3:
      if (LL_RCC_PLL3_IsReady() == 0U)
      {
        if (LL_RCC_PLL3_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    case LL_RCC_ICCLKSOURCE_PLL4:
      if (LL_RCC_PLL4_IsReady() == 0U)
      {
        if (LL_RCC_PLL4_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    default:
      /* Unexpected */
      ret = 0U;
      break;
  }

  /* Check PLLSource2 clock source */
  switch (PLLSource2)
  {
    case LL_RCC_ICCLKSOURCE_PLL1:
      if (LL_RCC_PLL1_IsReady() == 0U)
      {
        if (LL_RCC_PLL1_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    case LL_RCC_ICCLKSOURCE_PLL2:
      if (LL_RCC_PLL2_IsReady() == 0U)
      {
        if (LL_RCC_PLL2_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    case LL_RCC_ICCLKSOURCE_PLL3:
      if (LL_RCC_PLL3_IsReady() == 0U)
      {
        if (LL_RCC_PLL3_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    case LL_RCC_ICCLKSOURCE_PLL4:
      if (LL_RCC_PLL4_IsReady() == 0U)
      {
        if (LL_RCC_PLL4_IsEnabledBypass() == 0U)
        {
          ret = 0U;
        }
      }
      break;
    default:
      /* Unexpected */
      ret = 0U;
      break;
  }

  return ret;
}

/**
  * @brief  Attribute configuration of a group of Items.
  * @param  ItemGroupIdx the Item group Index to configure
  * @param  Item Item(s) to set attributes on.
  *         This parameter can be a one or a combination of @ref RCC_items, masked with RCC_ITEM_MASK
  * @param  Attributes specifies the RCC secure/privilege/public/lock attributes.
  *         This parameter can be a combination of @ref RCC_attributes
  * @retval None
  */
static void RCC_ATTR_ConfigItemGroup(uint32_t ItemGroupIdx, uint32_t Item, uint32_t Attributes)
{
  __IO uint32_t *p_rcc_reg = &(RCC->SECCFGR0) + (0x4UL * ItemGroupIdx);

  if (ItemGroupIdx != RCC_ITEM_GROUP_IDX_MEM)
  {
#if defined (CPU_IN_SECURE_STATE)
    /* Check item security attribute management */
    if ((Attributes & RCC_ATTR_SEC_MASK) == RCC_ATTR_SEC_MASK)
    {
      /* Configure item security attribute */
      if ((Attributes & RCC_ATTR_SEC) == RCC_ATTR_SEC)
      {
        SET_BIT(p_rcc_reg[0], Item);
      }
      else
      {
        CLEAR_BIT(p_rcc_reg[0], Item);
      }
    }
#endif /* CPU_IN_SECURE_STATE */

    /* Check item privilege attribute management */
    if ((Attributes & RCC_ATTR_PRIV_MASK) == RCC_ATTR_PRIV_MASK)
    {
      /* Configure item privilege attribute */
      if ((Attributes & RCC_ATTR_PRIV) == RCC_ATTR_PRIV)
      {
        SET_BIT(p_rcc_reg[1], Item);
      }
      else
      {
        CLEAR_BIT(p_rcc_reg[1], Item);
      }
    }

#if defined (CPU_IN_SECURE_STATE)
    /* Check item lock attribute management */
    if ((Attributes & RCC_ATTR_LOCK_MASK) == RCC_ATTR_LOCK_MASK)
    {
      /* Configure item lock attribute */
      if ((Attributes & RCC_ATTR_LOCK) == RCC_ATTR_LOCK)
      {
        SET_BIT(p_rcc_reg[2], Item);
      }
    }

    /* Check item public attribute management */
    if ((Attributes & RCC_ATTR_PUB_MASK) == RCC_ATTR_PUB_MASK)
    {
      /* Configure item public attribute */
      if ((Attributes & RCC_ATTR_PUB) == RCC_ATTR_PUB)
      {
        SET_BIT(p_rcc_reg[3], Item);
      }
      else
      {
        CLEAR_BIT(p_rcc_reg[3], Item);
      }
    }
#endif /* CPU_IN_SECURE_STATE */
  }
  else
  {
    /* For memory group, only public attribute is available */
#if defined (CPU_IN_SECURE_STATE)
    /* Check item public attribute management */
    if ((Attributes & RCC_ATTR_PUB_MASK) == RCC_ATTR_PUB_MASK)
    {
      /* Configure item public attribute */
      if ((Attributes & RCC_ATTR_PUB) == RCC_ATTR_PUB)
      {
        SET_BIT(*(p_rcc_reg), Item);
      }
      else
      {
        CLEAR_BIT(*(p_rcc_reg), Item);
      }
    }
#endif /* CPU_IN_SECURE_STATE */
  }
}

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
